{
    "$description": "Core spacing primitives defining the spatial system. Based on a 4px/0.25rem base unit with 8px grid alignment for consistency. Use spacing tokens for margins, paddings, and gaps. RULE: Always use spacing tokens instead of arbitrary values to maintain visual rhythm and consistency across the UI.",
    "spacing": {
        "$type": "dimension",
        "$description": "Component-level spacing scale for padding, margins, and gaps. Follows a systematic scale from micro (2px) to macro (80px) spacing based on pixel values. Use 2-8 for compact UIs, 12-16 for standard spacing, 20-24 for breathing room, and 32+ for section/page-level separation.",
        "2": {
            "$value": "0.125rem",
            "$description": "Micro spacing (2px). Use for: hairline gaps, subtle visual separations, icon optical adjustments, fine-tuning alignment. Common in: stacked icons, tight inline elements, border spacing, minimal breathing room between dense elements."
        },
        "4": {
            "$value": "0.25rem",
            "$description": "Very small spacing (4px). Use for: compact component internal gaps, tight list items, dense table cell padding, icon-to-text micro gaps. Common in: tags, badges, compact chips, dense data displays, inline code blocks."
        },
        "8": {
            "$value": "0.5rem",
            "$description": "Small spacing (8px). Use for: tight padding in compact components, icon-to-text gaps, small button padding, dense form layouts. Common in: small buttons, compact inputs, toolbar items, pill badges, tight card grids."
        },
        "12": {
            "$value": "0.75rem",
            "$description": "Standard small spacing (12px). Use for: standard component internal padding, form field padding, list item padding, comfortable compact UIs. Common in: buttons, inputs, dropdowns, list items, alert padding, menu items."
        },
        "16": {
            "$value": "1rem",
            "$description": "Base spacing (16px). DEFAULT spacing value. Use for: standard gaps between elements, default component padding, card content padding, form group spacing. Most common spacing value in the system - the baseline reference."
        },
        "20": {
            "$value": "1.25rem",
            "$description": "Medium spacing (20px). Use for: generous component padding, separation between related groups, comfortable breathing room. Common in: card padding, dialog content padding, section sub-dividers, relaxed form layouts."
        },
        "24": {
            "$value": "1.5rem",
            "$description": "Large spacing (24px). Use for: modal/dialog padding, card spacing, comfortable content separation, generous component margins. Common in: modal containers, feature cards, dashboard panels, content sections."
        },
        "32": {
            "$value": "2rem",
            "$description": "Extra large spacing (32px). Use for: major content block separation, large card padding, section dividers within pages. Common in: page sections, hero content padding, feature showcases, spacious card layouts."
        },
        "40": {
            "$value": "2.5rem",
            "$description": "Section spacing (40px). Use for: significant section separation, generous layout margins, prominent content blocks. Common in: landing page sections, dashboard section gaps, major content dividers."
        },
        "48": {
            "$value": "3rem",
            "$description": "Large section spacing (48px). Use for: large section breaks, page-level content separation, hero component internal spacing. Common in: page headers, major layout divisions, feature section padding."
        },
        "56": {
            "$value": "3.5rem",
            "$description": "Page section spacing (56px). Use for: substantial page section margins, generous hero padding, prominent content area separation. Common in: landing page hero sections, major page divisions, marketing layouts."
        },
        "64": {
            "$value": "4rem",
            "$description": "Major section spacing (64px). Use for: major page section breaks, hero section padding, significant layout whitespace. Common in: page-level section gaps, hero components, full-width content dividers."
        },
        "72": {
            "$value": "4.5rem",
            "$description": "Expansive spacing (72px). Use for: very large section separation, expansive layout margins, premium whitespace. Common in: marketing pages, landing hero sections, high-emphasis content areas."
        },
        "80": {
            "$value": "5rem",
            "$description": "Maximum spacing (80px). Largest spacing value. Use for: maximum section breaks, largest page margins, expansive hero sections. Common in: landing page hero areas, major page divisions, spacious marketing layouts. Use sparingly - represents maximum breathing room."
        }
    },
    "gridSpacing": {
        "$type": "dimension",
        "$description": "Grid and layout gutter spacing based on 8px grid. Use for CSS Grid gap, Flexbox gap, and multi-column layout gutters. Pixel values for precise grid alignment. All values are multiples of 8px.",
        "xs": {
            "$value": "8px",
            "$description": "Extra small grid gap (8px). Use for: compact card grids, dense dashboard layouts, mobile-optimized grids, icon grids. Minimum comfortable gap for touch targets."
        },
        "sm": {
            "$value": "16px",
            "$description": "Small grid gap (16px). Use for: standard card grids, form layouts, compact dashboard grids. Good default for most grid layouts."
        },
        "md": {
            "$value": "24px",
            "$description": "Medium grid gap (24px). Use for: default content grids, spacious card layouts, comfortable dashboard grids. Balances density with readability."
        },
        "lg": {
            "$value": "32px",
            "$description": "Large grid gap (32px). Use for: spacious card layouts, content grids, marketing pages. Good for layouts with larger cards or content blocks."
        },
        "xl": {
            "$value": "40px",
            "$description": "Extra large grid gap (40px). Use for: hero grids, feature showcases, landing page layouts. Creates clear separation between grid items."
        },
        "xxl": {
            "$value": "48px",
            "$description": "Double extra large grid gap (48px). Use for: maximum separation in grids, presentation layouts, sparse artistic layouts. Rarely needed - consider if layout needs restructuring."
        }
    },
    "verticalRhythm": {
        "$type": "dimension",
        "$description": "Baseline-aligned spacing for vertical rhythm in typography-heavy layouts. Based on 1.6rem (25.6px) baseline. Use for consistent vertical spacing in prose content, documentation, and text-heavy interfaces. Maintains readable flow in long-form content.",
        "xs": {
            "$value": "0.4rem",
            "$description": "Quarter baseline (6.4px). Use for: list item spacing within tight lists, line spacing adjustments, micro-spacing in prose. Minimal vertical separation."
        },
        "sm": {
            "$value": "0.8rem",
            "$description": "Half baseline (12.8px). Use for: heading bottom margins, spacing after inline elements, paragraph-adjacent element spacing. Creates subtle but noticeable separation."
        },
        "md": {
            "$value": "1.6rem",
            "$description": "Single baseline (25.6px). DEFAULT prose spacing. Use for: paragraph margins, standard content block spacing, default vertical rhythm. One full line height of separation."
        },
        "lg": {
            "$value": "2.4rem",
            "$description": "1.5 baselines (38.4px). Use for: heading top margins, spacing before new sections within content, emphasis breaks. Creates clear topic transitions."
        },
        "xl": {
            "$value": "3.2rem",
            "$description": "Double baseline (51.2px). Use for: major section breaks in prose, chapter-level separations, significant content divisions. Two full line heights of separation."
        },
        "2xl": {
            "$value": "4.8rem",
            "$description": "Triple baseline (76.8px). Use for: page section breaks, major content area separations, hero-to-content transitions. Maximum prose spacing - use sparingly."
        }
    }
}
